# RoomConstructionSetParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomConstructionSetParam Property
ParameterTypeId Class See Also
---
"Construction Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomConstructionSetParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomConstructionSetParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomConstructionSetParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace